In [16]:
import pandas as pd 
import numpy as np 

df = pd.DataFrame({'ID':['10001','10001','10002','10002','10002'],
                 'skill':['python','java','python','C++','java']},index=['a','b','c','d','e'])

In [17]:
df

      ID   skill
a  10001  python
b  10001    java
c  10002  python
d  10002     C++
e  10002    java

In [18]:
data = df.groupby('ID')['skill'].apply(lambda x:x.str.cat(sep=':')).reset_index()

In [19]:
data

      ID            skill
0  10001      python:java
1  10002  python:C++:java

In [20]:
data['skill'].str.split(":")

0         [python, java]
1    [python, C++, java]
Name: skill, dtype: object

In [21]:
data['skill'].str.replace(":",'-')

0        python-java
1    python-C++-java
Name: skill, dtype: object

In [24]:
data['skill'].str.extract("([^:]+)")

        0
0  python
1  python

In [30]:
from datetime import datetime
start = datetime(2017, 10, 1)
# end = datetime(2018, 10, 1)
rng = pd.date_range(start, periods=6)
rng

DatetimeIndex(['2017-10-01', '2017-10-02', '2017-10-03', '2017-10-04',
               '2017-10-05', '2017-10-06'],
              dtype='datetime64[ns]', freq='D')

In [27]:
d = pd.DataFrame({'id':['10001','10002','10003'],'tel':['111-222-333','111-333-444','222-333-444'],
                'dates':pd.date_range(start=2017-10-1,periods=3)})

In [28]:
d

      id          tel                         dates
0  10001  111-222-333 1970-01-01 00:00:00.000002006
1  10002  111-333-444 1970-01-02 00:00:00.000002006
2  10003  222-333-444 1970-01-03 00:00:00.000002006

In [29]:
d1=d['tel'].str.split('-',expand=True)

In [30]:
d1

     0    1    2
0  111  222  333
1  111  333  444
2  222  333  444

In [31]:
d3=d.drop('tel',axis=1).join(d1)

In [32]:
d3

      id                         dates    0    1    2
0  10001 1970-01-01 00:00:00.000002006  111  222  333
1  10002 1970-01-02 00:00:00.000002006  111  333  444
2  10003 1970-01-03 00:00:00.000002006  222  333  444

In [33]:
d3['data']=pd.to_datetime(d3['dates'])

In [35]:
d3=d3[['data']]

In [36]:
d3.rename(columns={'0':'tel_1','1':'tel_1','2':'tel_2'},inplace=True)

c:\users\star\appdata\local\programs\python\python38\lib\site-packages\pandas\core\frame.py:4296: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().rename(

In [139]:
d3

      id                         dates  ...    2                          data
0  10001 1970-01-01 00:00:00.000002006  ...  333 1970-01-01 00:00:00.000002006
1  10002 1970-01-02 00:00:00.000002006  ...  444 1970-01-02 00:00:00.000002006
2  10003 1970-01-03 00:00:00.000002006  ...  444 1970-01-03 00:00:00.000002006

[3 rows x 6 columns]

In [140]:
d3.to_excel('./111.xls')

In [55]:
d3

      id                         dates    0    1    2
0  10001 1970-01-01 00:00:00.000002006  111  222  333
1  10002 1970-01-02 00:00:00.000002006  111  333  444
2  10003 1970-01-03 00:00:00.000002006  222  333  444

In [37]:
df=d3.groupby(by=['id'])['0'].sum()

KeyError: 'id'

In [59]:
import pandas as  pd 
dfdata = pd.read_excel('./111.xls')

In [60]:
groupby=dfdata.groupby('城市')['城市'].value_counts()

In [61]:
groupby

城市  城市
上海  上海    6
北京  北京    6
厦门  厦门    5
成都  成都    6
Name: 城市, dtype: int64

In [62]:
groupby.index=groupby.index.droplevel(level=0)

In [63]:
groupby

城市
上海    6
北京    6
厦门    5
成都    6
Name: 城市, dtype: int64

In [65]:
df=pd.DataFrame(groupby)
df.columns=['城市计数']
finish=df.reset_index()
finish

   城市  城市计数
0  上海     6
1  北京     6
2  厦门     5
3  成都     6

In [66]:
import pandas as pd
import numpy as np
# 创建dataframe
data = pd.DataFrame({"key": list("abbcaabac"),
                     "value": [1, 2, 3, 4, 5, 6, 7, 8, 9]})

print(data)

  key  value
0   a      1
1   b      2
2   b      3
3   c      4
4   a      5
5   a      6
6   b      7
7   a      8
8   c      9

In [67]:
# 按key分组
data_group = data.groupby(data["key"])
# 分组后的结果不能直接输出
print(data_group)    # 输出的是data_group的类型

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000000001899B5E0>

In [68]:
for key, value in data_group:
    print(key)
    print(value)
    print(type(value))

a
  key  value
0   a      1
4   a      5
5   a      6
7   a      8
<class 'pandas.core.frame.DataFrame'>
b
  key  value
1   b      2
2   b      3
6   b      7
<class 'pandas.core.frame.DataFrame'>
c
  key  value
3   c      4
8   c      9
<class 'pandas.core.frame.DataFrame'>

In [69]:
new_data = pd.DataFrame(columns=["key", "value"])
print(new_data)

Empty DataFrame
Columns: [key, value]
Index: []

In [70]:
for key, value in data_group:
    new_data = pd.concat([new_data, value])
print(new_data)

  key value
0   a     1
4   a     5
5   a     6
7   a     8
1   b     2
2   b     3
6   b     7
3   c     4
8   c     9

In [134]:
new_data.index = np.arange(len(new_data.index))
print(new_data)

  key value
0   a     1
1   a     5
2   a     6
3   a     8
4   b     2
5   b     3
6   b     7
7   c     4
8   c     9

In [135]:
obj = pd.DataFrame(np.arange(9).reshape(3,3),index=['a','b','c'],columns=['te','ge','fr'])

In [136]:
obj

   te  ge  fr
a   0   1   2
b   3   4   5
c   6   7   8

In [89]:
obj.set_index('te')

    ge  fr
te
0    1   2
3    4   5
6    7   8

In [90]:
obj.set_index('te',drop=False)

    te  ge  fr
te
0    0   1   2
3    3   4   5
6    6   7   8

In [91]:
obj.set_index('te',append=True)

      ge  fr
  te
a 0    1   2
b 3    4   5
c 6    7   8

In [92]:
obj.set_index('te',inplace=True)

In [93]:
obj

    ge  fr
te
0    1   2
3    4   5
6    7   8

In [96]:
obj2=obj.set_index('ge')

In [97]:
obj2

    fr
ge
1    2
4    5
7    8

In [98]:
obj2.reset_index()

   ge  fr
0   1   2
1   4   5
2   7   8

In [99]:
obj2.index.names=['f','s']

ValueError: Length of new names must be 1, got 2

In [1]:
import pandas as pd 
import numpy as np 

df=pd.read_excel('./222.xlsx')

In [2]:
df

   Unnamed: 0  A  B  C
0           0  a  1  c
1           1  a  3  a
2           2  a  2  b
3           3  c  3  a
4           4  c  2  b
5           5  c  1  c
6           6  b  2  b
7           7  b  3  a
8           8  b  1  c

In [3]:
df.drop(['Unnamed: 0'],axis=1,inplace=True)

In [4]:
df

   A  B  C
0  a  1  c
1  a  3  a
2  a  2  b
3  c  3  a
4  c  2  b
5  c  1  c
6  b  2  b
7  b  3  a
8  b  1  c

In [5]:
df

   A  B  C
0  a  1  c
1  a  3  a
2  a  2  b
3  c  3  a
4  c  2  b
5  c  1  c
6  b  2  b
7  b  3  a
8  b  1  c

In [13]:
import xlsxwriter  #调用xlswriter包，用来生成表
writer=pd.ExcelWriter('./fenzubaocungebiao.xls') #生成一个新 工作簿
df_1=df.groupby('A').apply(lambda x:x.sort_values('B')).reset_index(drop=True)
for item in df_1['A'].unique():
    df_2 = df_1[df_1['A']==item]
    df_2.to_excel(writer,sheet_name=item,index=False)
writer.save()

In [122]:
import numpy as np
import pandas as pd
from pandas import DataFrame,Series
df1=DataFrame({'symbol':['001','001','002','002','003'],
'tdate':['201901','201902','201901','201902','201901'],
'open':np.random.randint(0,50,5),
'close':np.random.randint(50,100,5)})

print(df1)

grp1=df1.groupby('symbol')
grp2=df1.groupby(['symbol','tdate'])

print('#可用循环语句访问组名和每组的内容')
for name,group in grp1:
    print(name)
    print(group)

# print('#通过组名访问数据')
# print(grp1.get_group('001'))
# print(grp2.get_group(('001','201901')))

print('#计算指定列的均值 三种等价写法')
print(grp1.open.mean())
print(grp1.open.agg('mean')) #这里函数mean要加引号 如果是自定义函数不需要
print(grp1.agg({'open':'mean'})) #这里指定了列名 返回DataFrame而非Series

print('#计算指定列的指定聚合方法')
def my_func(x):
    return max(x)-min(x)
print(grp1.open.agg(my_func))
print(grp1.open.agg(lambda x:max(x)-min(x))) #用匿名函数

print('#对指定列进行计算处理')
print(grp1.open.apply(lambda x:x+100))

  symbol   tdate  open  close
0    001  201901    23     70
1    001  201902    21     78
2    002  201901     9     56
3    002  201902    46     72
4    003  201901    33     52
#可用循环语句访问组名和每组的内容
001
  symbol   tdate  open  close
0    001  201901    23     70
1    001  201902    21     78
002
  symbol   tdate  open  close
2    002  201901     9     56
3    002  201902    46     72
003
  symbol   tdate  open  close
4    003  201901    33     52
#计算指定列的均值 三种等价写法
symbol
001    22.0
002    27.5
003    33.0
Name: open, dtype: float64
symbol
001    22.0
002    27.5
003    33.0
Name: open, dtype: float64
        open
symbol
001     22.0
002     27.5
003     33.0
#计算指定列的指定聚合方法
symbol
001     2
002    37
003     0
Name: open, dtype: int32
symbol
001     2
002    37
003     0
Name: open, dtype: int32
#对指定列进行计算处理
0    123
1    121
2    109
3    146
4    133
Name: open, dtype: int32

如何把dataframe中某列的值数组拆分并生成新的dataframe

In [23]:
import pandas as pd
import numpy as np
# from pandas import DataFrame,Series
frame = pd.DataFrame({"A": ["drw1", "drw2", "drw3"],
                   "B": [[1, 2], [1,3], [2,3,4]],
                   "C": ["a", "b", "c"]})

def f(x):
    d=[]
    for i in x.B:
       d.append({"A": x.A, "B": i, "C": x.C})
    return d

d = list(frame.apply(f, axis=1).cumsum().tail(1))[0]

new_frame = pd.DataFrame(d)
print(new_frame)

      A  B  C
0  drw1  1  a
1  drw1  2  a
2  drw2  1  b
3  drw2  3  b
4  drw3  2  c
5  drw3  3  c
6  drw3  4  c

In [26]:
frame = pd.DataFrame({"A": ["drw1", "drw2", "drw3"],
                   "B": [[1, 2], [1,3], [2,3,4]],
                   "C": ["a", "b", "c"]})

new_frame2 = frame.groupby(["A", "C"]).B.apply(lambda x: pd.DataFrame(x.values[0])).reset_index().drop("level_2", axis=1)
print(new_frame2)

      A  C  0
0  drw1  a  1
1  drw1  a  2
2  drw2  b  1
3  drw2  b  3
4  drw3  c  2
5  drw3  c  3
6  drw3  c  4

In [125]:
import pandas as pd

df = pd.DataFrame({'A':['bob','sos','bob','sos','bob','sos','bob','bob'],
              'B':['one','one','two','three','two','two','one','three'],
              'C':[3,1,4,1,5,9,2,6],
              'D':[1,2,3,4,5,6,7,8]})

In [126]:
grouped = df.groupby('A')

for name,group in grouped:
    print(name)
    print(group)

bob
     A      B  C  D
0  bob    one  3  1
2  bob    two  4  3
4  bob    two  5  5
6  bob    one  2  7
7  bob  three  6  8
sos
     A      B  C  D
1  sos    one  1  2
3  sos  three  1  4
5  sos    two  9  6

In [127]:
d = grouped.apply(lambda x:x.describe())
print(d)

                  C         D
A
bob count  5.000000  5.000000
    mean   4.000000  4.800000
    std    1.581139  2.863564
    min    2.000000  1.000000
    25%    3.000000  3.000000
    50%    4.000000  5.000000
    75%    5.000000  7.000000
    max    6.000000  8.000000
sos count  3.000000  3.000000
    mean   3.666667  4.000000
    std    4.618802  2.000000
    min    1.000000  2.000000
    25%    1.000000  3.000000
    50%    1.000000  4.000000
    75%    5.000000  5.000000
    max    9.000000  6.000000

In [128]:
import pandas as pd

df = pd.DataFrame({'A':['bob','sos','bob','sos','bob','sos','bob','bob'],
              'B':['one','one','two','three','two','two','one','three'],
              'C':[3,1,4,1,5,9,2,6],
              'D':[1,2,3,4,5,6,7,8]})


grouped = df.groupby('A')

for name,group in grouped:
    print(name)
    print(group)

d = grouped.apply(lambda x:x.head(2))

bob
     A      B  C  D
0  bob    one  3  1
2  bob    two  4  3
4  bob    two  5  5
6  bob    one  2  7
7  bob  three  6  8
sos
     A      B  C  D
1  sos    one  1  2
3  sos  three  1  4
5  sos    two  9  6

In [129]:
def get_top(df):
    return df.head(2)

d = grouped.apply(get_top)

In [130]:
d

         A      B  C  D
A
bob 0  bob    one  3  1
    2  bob    two  4  3
sos 1  sos    one  1  2
    3  sos  three  1  4

In [131]:
def get_top(df,n):
    return df.head(n)

d = grouped.apply(get_top,n=3)

print(d)

         A      B  C  D
A
bob 0  bob    one  3  1
    2  bob    two  4  3
    4  bob    two  5  5
sos 1  sos    one  1  2
    3  sos  three  1  4
    5  sos    two  9  6

In [132]:
import pandas as pd

df = pd.DataFrame({'A':['bob','sos','bob','sos','bob','sos','bob','bob'],
              'B':['one','one','two','three','two','two','one','three'],
              'C':[3,1,4,1,5,9,None,6],
              'D':[1,2,3,None,5,6,7,8]})


grouped = df.groupby('A')

for name,group in grouped:
    print(name)
    print(group)

def fill_none(one_group):
   return one_group.fillna(one_group.mean()) # 把平均值填充到空值里面


d = grouped.apply(fill_none)
print(d)

bob
     A      B    C    D
0  bob    one  3.0  1.0
2  bob    two  4.0  3.0
4  bob    two  5.0  5.0
6  bob    one  NaN  7.0
7  bob  three  6.0  8.0
sos
     A      B    C    D
1  sos    one  1.0  2.0
3  sos  three  1.0  NaN
5  sos    two  9.0  6.0
         A      B    C    D
A
bob 0  bob    one  3.0  1.0
    2  bob    two  4.0  3.0
    4  bob    two  5.0  5.0
    6  bob    one  4.5  7.0
    7  bob  three  6.0  8.0
sos 1  sos    one  1.0  2.0
    3  sos  three  1.0  4.0
    5  sos    two  9.0  6.0